node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866910994052887
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866910994052887
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 6036288
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "\364\212\301\275ac\321\275\035|`\275T,V>\024\235\017>\223T\205=\006=\301<\331\262u\276@\372\334\275+ \367=Q\342\204\274\274Z-\276\353\3232>\204\r\233\275\366\253\021>\372\234\314=\372\262\312\275\257\343\220>\'[\345\275\2757\263=\265Jm=: \002\275\222\025\274<,.\321=\314DL>T\214\002<\355!\343\275~5\030<\342\370\t=\323-@>\023\230n\275\273 \n\276\325\345\373\275\020\320\310\275\362A/\275\035&\306=<x\013\275\256\215\036\276;\334)=1\242u>\332\020\233=\253\363\337\274\026 \221=b\343\000>Hm\217>v\356\007>\210\273\221=\303\267\206<3\311\212=\322x >\302ON\274\"L\013\274\274YN>\004|\273\275c\333(\276t\270\347=\244\254\214>k\003\027\274H4\\\276zF\226\275\025\262\344\273\217\000D=-(\321>\321\005%\276\332JR\276\347\232\232=\200\337D>\023)|\275\241\017\311=:\010\221=\344\270H\274\350\327\033\2754-\\\275\314\006\306\275wD/\275[\013\245=\177\376\033\272\025o\207\275\236\336\301>9\234\266=\227&\022\275\326\255\311\2742\245\257<\253\326\211<{\205\333=\324\252\257=\327\377\267= <\223\275\211U\013\273\332\237a=\224\365\212\275\230\276\366=\330\233O>6+F>\337X\306\274\311*)>\373\256f\275\274\271\033=\311\027\271\272\343\377\357=>l\261=6`\352=\213\271\n>\202\350\026<4\314\221\275T\207}>\303\220\270\275L+\354;\347\034H>\312\257&>\367\013\246\276/\227\025\276\270]$=\351\036\366\275w\303\251=\371\314n<\034S\216=\374\030}=R\006\227\275\224\t(;\265\311\265\273\211B\252=\221m&\276\364\023#\276\221*\033>\177j\265>/\231\237<\244\245\276=\366.\247>\031#\203\275s\255_>\255\222\365\272\246\3208\275\212\214\"\275\2679\215\275\234\030\023>\320;\362=\230p\371=eK#=\302\270\n\275\200X\221\274\232q\'=\007Y\010>x\027y\276\003\223!\276)\264[>\213\315\275<Y^\016\276+\306\t\275\031K\366\274\023\325\017\276u\327\262\275\000\262\351=\307@O\274{\241\223=\220\247\001\276/\035n=\010\364;\276\001\306\014=\3138Z>\364\237q\274E\350?>\244\2678\275.\276\350=AB\037>\20675\275x9\216<\265\330\275\274\216\270\330=*v\221<L@\317=-\211\314\275D\373\315;\357\355e>\001\212\346=\304\363\020>\232\331\275\275\010\251$\276\305\240\270\275&\371\347\275\227\252\303;\345u\221\2758Z\314=`\016\320=\325\177D\275\354\377z\275\2305\314\275\261i\216>G\035\343\275\023\343\302>\323\032\031\275\255\274|\273\034nB>\032\010*\276A3\336\275$\277<\276\032j/\276\232\n\224>\207w\242=\344;\310\275\323\277\236=\225$\301\275\374\300\r>t\262\220<\330\255\264\275^\217\251\275\257h\335=\215I\313\275\312\3146=\341\320\352;X\323\214\273\263\241\316\275\232\275\363;\354\370\241;\273b\372=\'j\307\274\325\271:=:x*<\226]d<G\350\371<\020\334o\276\014 \262=\356\243\257\275\271V>>\307\2057\276\006F,=\031\025H>0\311\374=X\231\243\275^\017\024=\004\0340\275\027\343\320\274T\023\025;3v\367=\ra\236>\323\3570=24\034=]\302\374=\241\341\360=HVH\276\332\257p\275\241\335\212\276w10>\244Y\302=\242\325\006\276\324{\255=\021\002\341;1\205\010\276R#\305\275\354\177\320<,p5>T\244c\275\342r\\>\0014l<\220\303\307=Pn\244\274\320\310\022>\340\014\023\276a\244\371;\367{\334>\352\314E=M\256*>H2\016=\255\350\001\276Zz-\275w\320j\274\243\367\023<4\340k\275\203\264\332\274\210\374M\275\243EL=\377\370O\275FJ\265:>5\363=!\302\210\275\346\327\004\276\316Z\244=\203\030H=\350P\323\274O\314\010=\263\023\032=\010\310\242=\021\370\324<\271\357{\275\236\343\265\274\326\035\265\276&r\200\275\261U\004\275\026\212\325\274\004M\346\2757\222\033\275\235\021\204=\206\010\235>\"5z=\366i\223\274\375\204.>\355\234\215\275t0\000>\352yg>V\330]\276\325\371\223\272y?s=\022\255\350<\305\003\217<f\233\200<M\211\372<\256d\002\276\301\177\321=\221\367\n>e.\212\276\266Y\356\275\022I\237\274\306\261\227=\372\235\377=7\335_=\342\262\020=\262B\277\275\036l\303\275\237\t\301<\374\034u>\263d9>:\305\326=\262\213F>\\#v>\341\222\205=\274\202\004\275vh*\276\017\202\033\276\315:j=\013\202\006>\332\357U<\306B\210\276\334\037\016>\335\253\255\274\347{m>\375\037(>\177F#=\225\241\n\2746\266V>\221\274A\276d\025\037>\004\334\241<&\324l\276\337\234\\>&\206\375\275m\276\026\276W\277\024\274\372t\330<7\313\026>\367\356\022=/\372\342\274\321\264\036=P\204\205\276\275\371\006\276\355k\364;\376*\204<\235\320b=\250\000\240\273\311\035\237\274\034\016\002\276\264\023\331=\243}\255<\266Na\275B\340\005>[\247\031\276\261\340&\274<h\322=\037\026w\276\014\'\016=\230\224^\275r\246\370\275\020\005\320<\347\006\026=B\370\235\275xK\376=\363\372\377\274\330\037V>\346\t\244\275\025\354 >a\017(\276\220\375\370<\357\025\275\275\007:\000>\243;\254\276f\374&\276\226D\016>\370Z\351=m\031\037\276\2256\341<\273\306\033\274\370\316\036=@\201\037\276a/\\\276ch)\276\365\211}=\365<\233>\341?\230=\327z.\274\000WB>|+\032\276_h+\276!{\271\275\334/\002>\341g\033\276\255C\022\274\243\343\303<MP\226\274\333\323\257\271\361\364w=^D\222=P\263Q>\211\037\317\274{o\357\275\026\330\256\275\272\027\215\273\301\337\345=\'N\265=:\243\205>\001\312\315;\214G\350\27589\314=\215\035\003\274n\025\014\274P\035\234\276v\304\230=op\233\275/\353\353\275\306RW=\335\tj\275\"\311\r\276\020R\330</3Z> \337\260\274:\216\373\275\323Vh\274\277D0>\373q@<]\365\021>;\312\202\275\357\362\214=t\201\001>\317\326P\275w\252\375\274\376\274\223\275\347\303\361<\261&\031\276\330(\217=\304=\014\276\n\313\307<\351{\006>ZS\234\276\224t>\275-T\367\275#f\034>\355\271S\275B\214\342=O\233!>$G%\275\237\244V\276AX\324=\024\253(\275\tr\201\276[W$\276xj)\276<\276\247=\036\003\024>]\351\250\275\252\362\365= \3247\275 \265L=\377\352\037\276\204\331\301=\214Y\367\275p\342\342<\346\261Y\276\002\215\274=F[(\273>\263\230=\204\003\236>;\3147\276\245\373\247<Wm\217\275}\201\261=\347<\246\275\252\276W\276Q\276\244\274\342\n\303\275w\330\017>5j\242<\235u\037\276\362:\035\276}\305\223\276\346\306{=;\205}\275n\266\036>\303\361\231\275\031\272O\275\211\013\275=\361\227\352=[\357j=`\335\207=\371\374\353=\354\304l\276\3771\342\274u[K\275 \315t\275\243\246b>{.\347\275\352\304U=\200$.>\275/\243=\330\264[><:\323\276\255\006\006\2762\227\312\275\026\244\005\276\216L\013\274r\302\313\275Q\270^=\2557\036>e\376\377=\247\363\227=;\355\"\275\376\220\351\275\366\037R<\271H\020\276aA@=\204\266\013\275\224p:=\337 \023=\244\227H<\014\"\336\275\327\301\205\276g\023\333<\340\237\321=xPG=\246\256\013=J\255\216\276\353\245@\274\274\313\362<\367\032\270\275j\031\231=_j\035\275\241\257\250\276cl\010>\035O\'\275\247\357\356=\356].=x\361\306=\230\375\215<z?\237<=\377l\276e\273\025>\222\032X>\342\203E\275\215\306\230\275\374z/\276\311W\240\275]m\257\275\275\252\202\273\247\"\205\276\n\351\252\275Y%T=t\355|=\224\315J\275\241\223\303=>\244M>j;R>\330\227&=\276\242\251=\270\243\002=\243\257\373\275\2235\370\275\306w\260=<\374\277=\347))>[\230\252\275\325\266\223<\201\347\003>\241\321\223=F\301\337\275\341M\031\276RT\303\2745\241\363\275\014;q= $;\276\200\323\315\275\237\022}=NS\255=\365\236\306\275Z\240$\276:\311y>\367j\215=!\226\377=w\0342>\275~N>\200\310K>\245n\362=\337Y\261<J9(>\352\204(<\334=&>\022U\317\274g\300\267\275=\325A\275\276\332\033\276\227Pn\276\211}2\2761}A\275P\033\233=W\246e<\032\331\035\275ugB\273[\340\335\275\371\221\252=\256\205\230=\"\254\260=\210\360\241=1\031\240\276\301A)=\330\266L\275\000i\264\275p\355\220\276+\351\365\273}Y\353\274\003\373\325=\325|:>\326\032\343\275}\266-=x\2508\276W\021B>]\031\200\276\215\227|>\023\230\256=\244H\332=\340\345\250=/[^<\2232\355=\267\356\300=\034\231\246\274\0225$\275M4\271=1*\320=\312\016~\275\323\363\002\275\265\274E\274Tz\033\276\364\225B<z\371\236\275\034(\005>U\024e\275\252\203\003\276\316\016\314<x\034\363\275q;\317=\241\367\021=\330\204\005>\007C\314\276\354\374\374=Py\311\275\363J\302\275\346pG\276\365\312\374\274\344|\323\273.\016\023=\212\222\353=\2272\230>\261!\352=\362\321\213=\023\023F>:X<\275^K+\273s\275\237\275,P\370=S?\341\275\322\264\334=\'&\364\275\210\214\272\273\267:%=\360\362>=\330\235\200\276\017rS>\027\362\325\274\034,\374=\t(d\274\270\251\341<\232\336\021\275\023\350\352\275-\257\013>\224i;\276Rk&\276K/\245\275\014(\202\275\367Af\276\277\306\t>T 1\276*A1<\325\213\030>\342%g\275/r\256=U\242\021\276\343\307\305\275*\326\342=\311\367\220;\000[:\275.\335*\275\036\314\375\275\224\030\214\275\345f\337\275\224\272\261<\371P\210=\354\364D\276\263\236X\2767\301\235\276\200{)\276\023\310\251=\001\252+>\256\247B\275\313LZ>\216\366W\275\023\320Z\275j\366\340=R\361\214>\311\256\205\275\335\245*=4i\351\275\3167?\276\356\204A>R\206\021\276\224\353\376=#\275w\275\254y%=\253\223c=\0209\005>\230\335\325=M\224u><\026\341=\323\301P\276\204\364\343<\\3w=\304\023l\2752\263c=uG\300\274\367\362\327=\334\316\034;\204P\255>\325h{\276\\k\310=\222\244\206\274?\206\243\273\236\301\n\276\247\226m:\005\357A\275\2558=\274x\007u\276\0324\342\274J`[=#\007d\276\232\365\322=*2I\275\2255w\276e!\035\275\234H\035>\366\207#\275\242\225\201>\250\346\355\274\300~\350=h\022\003>\000\333\347\274ui\373<\335\302\333=\246E\355<\014U\342\275\265\266\355\274^\262A>\004\370\024\276lJ\033<\013\376\340\274\243\255\350<\367\014\022\276\271\025\221=\331\324\256\275\337!\013\276\247V\202=\242z\003\276\005ql=\017I(>\263\025*>\n\337\031\275O\352\257\274l\204/\276\375\331H>\004\361\227<\350\232\300<\030\326\025\276\277@\355\274/\036\305=OI\375\274\252v\205=\273\240\'\276g\326\345=\316y\n>\353\213\027\276\262,b>\340\337\266=;\024-\276\206#2\275\376\'\215;\020\304@\276\235\244\032\276f\372\210\275\271m+\276\010\263}\275L\037\004\276B\247\236<\315\212\033>b__>X\254\247\275\212w\026=\025bY\275{H\362<\342\325\007=\252\257\206=\220\306\336\275\321\270R>\000\371P\276\372\304\023\276F\001H=\257\215\">9\020\231>^r\"\276\324\270\214\275\323\037}>\376\336[>\032\306\027>\226\366\t\275\003Y\322;\213\265\255\275R\024\207=wj\336=|\034v>\302M\261\275g|\021>\272\t\002<\364\251\331\274\027\'w\275\014\032\247\274B\265r\275\2242\211>#\201\257\275\204\t\250<cD\203<r\204\010>e\nk\274\354(\276<i\330\265\2751x\210\275MG0=lp\272=J\rf\275\227\322S\276\233\357\016\275\212\031\357=\237H\025>\332.\225\275\274\206N\274\257H:\276\253\2472\275\3754\034\275\261\215\200>L\266z\275{h\203=\204%\027\275\205\241\226=u\t{=\007\r\330=fe\356\274\000\006l>\333\311\362<*\244\002\276\357\207\333=A\220-\276lTP>\265\005\303=\350\3160>\ry\315=\224\215\232=\341%\345\275\277\352\212\276\377l\320=z\333Q>z!\025<\225\226.>/\342\253=\253\030\275=\365\250!>\244\254\035\276D\016\222\276P\367_>\323G\255<\364K\016\274\271-\t<C!@\275\327jQ\275!60\276l\002\210\275Qb1>U\307\023<\340\tl>\371\204\037>O\021{\276z.\000>\351\350G>1\'\006=H\2651=\232\231a\275\255ch>\212\372\035>\230\234\271\276|\224(>\335\330)\275\306\013B\275J\227v=M\321*\2754Gu\275\212\273{=\205Md\274\325\3211>\331\333\253\275\027\017W>y\357\030\276\233\032%=\210\207\021=\211{8\276\350\345X\276\374\331T\275\260N\231\273=\246I>\177\266S>!\330\262<~a~;n\354+>T.\222\275K(s=\363\202<\274\270\313\203=i\2337\276\354U\245\275&\027\277\275c\276\257<Q\341M\276%\276\017\275W\206\036\276\271\022\303=:ol\275l\374\000\276\330\352\005\276i\376\315=:\3607\275\026\226E\2750\014\005\275\263\3522<L}7>9\376P>An2>\342Y(\276Ik\332=w7\033\276\021B\354=.\360\325\275\271\030i\276g$\334=8,&\275S\236\227\274\"\304\t\276\304\272\021>\'\2454\276=\024Z\275\327\271\014\276\354\322\307=\310\245\271=\332\314\255=\270\226\215\275C\013\027\276Z\"\365\274\n\007\033>d\310\262\274\347\310\005=\221\202@\2742\r\t\274\2122\272\274\270\273\277\274n$\243\274\361\202\255=o\232\032>\023\245\245\275\213\257\000\274|\022D=\224F\n\276\016\355z>\r\242\320=\216\352\250\275\265\215\266=N\341\243\275\363\320a\276 \3654\275\2178\323=\3640^\276M\263%=/7s>!\225\365=\262\037\346=\342\350\260\275\177D\262>,`\030>\007\250G\276K\255A>a\002h= $w=f\203\275\274`o\210\276\351\322\312>\277\322l=\201\225\222\275\356)5\27483\320;\t\200\243<\271\355\370=\036\331\250\275\367\367\211>\324\260\375<\025\207~\273w,\263<u\032\247\274\214\224\212\274\207\342\013\276u\215Y>\026\276\370=G\207\347=\227x\034>\217`\016\274a\027\217>v&\235=@\030\\\276b\257\024=M\313\253\275\223\234p\276\260\013\005>Pw)>\263\353\024=\271\n\013=\375\r\265\275\343\347%\276\267Du\274\355\202\036>w\363\224>\036U\265=\315d\277<v\3409\276\324\352t<\344\017*>\311zZ\274\035e\022\275\367\230\301\275(-\252\275N\270y<~v\200\275||i\275)N\360\275\362mb\2722=\341=\365]\307<i\360\267<\n\030\033=\356\0101\275\360;\232\274\351\210\036\275\013G+\276\370`$\275\227\204\351=\001\305+\275\2364\267\275\334\236\240\275\251\013\210\276\322\342\t>1 \t\276*\255^=\234\271&=\365i(=\320\225@=\361\376\365=\232#\357=\273\207L\276M\263\242\274\357\302\205>\335\200S\276\245\320\\\275\261\306x=CaW=\002\006S>\033\014\251=\231T\314\275Z\264\227:\267\252)\276\002\366\305=\313\021\307\275S\307\337\275~\331l\2760\014\265=T\232Z> !\343=O\246s=\224\033\272=1\325\315\275MS\374=\310\264T\276v\241\260={\002u\275y\207\275=jJ\353\275\247\275\237\274\324\3539\274\304A9>W\234\264<5\273)>\365\001\034\275\352p!\276uP~<\377\335\005\275\223\270d=\204\315\\=U\210\253\275Ml\234=\356\364\261< \2073>\001\317\220\276\313\036\\>\36650>f\252x=<\3657>\346\027\206>\321\363\251>\225\305\226\274!C\266=\"V\303\275YX\205<\r\240\202;\357\201\323\275\204\257\302=\177`6\275\373\225\233\275R\203\203=\365\\\006\276\262x\300\273}WN\276lS\374=\001\233B\276k\276\n\276\356\205\322\275\347]\035>\212M\372\275\tR(\276S\311\233=\207\034\007\276\270\331?={\372\037\276v\253\377\275~e\270\274WEL=\265c`=.N\215<\274\207V=\216g\222\276\"\240\017\276\370\332\010>\r:M\2757\223\020=\252\314\233\275\356\220\265\275\203\0061=\230\005o\275\016\335\234=\312\200\036>\n%y=u\315\n\274\330\r5\276\345\254\013=6\224f>Y\211\006\276.\301.\276\022\300\221\276W\257\332\275\302b%>\223\271\322\2754\213\251=W&L\275\376\247\200\274v\023E\275C\222\340\275.\314A\276"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_1"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_11/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_11"
  op: "StridedSlice"
  input: "net/Shape_1"
  input: "net/strided_slice_11/stack"
  input: "net/strided_slice_11/stack_1"
  input: "net/strided_slice_11/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_2"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_12/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12"
  op: "StridedSlice"
  input: "net/Shape_2"
  input: "net/strided_slice_12/stack"
  input: "net/strided_slice_12/stack_1"
  input: "net/strided_slice_12/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones/mul"
  op: "Mul"
  input: "net/strided_slice_12"
  input: "net/strided_slice_11"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones/Less/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1000
      }
    }
  }
}
node {
  name: "net/ones/Less"
  op: "Less"
  input: "net/ones/mul"
  input: "net/ones/Less/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones/packed"
  op: "Pack"
  input: "net/strided_slice_12"
  input: "net/strided_slice_11"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "net/ones/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones"
  op: "Fill"
  input: "net/ones/packed"
  input: "net/ones/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20000000298023224
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
