node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866910994052887
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866910994052887
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 8665499
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "\333q/>\372\314\177:\230\321\220<pu\201\275\340[\013>\336\222\313;L\263\325\275\035\357z=\217\375\365\275V|5\276\260\027\022>|\345I\274\377T\367=\237\327N\276\036\313\242<\236W\206\274iG\250\276>[:\276\305\200T\276\nfd>\202@O\274\320\264w>M\365\017\276\3074\014\275\346\224\022\276\327\213p=\343\337H>\324\3368=b\"\333\274\006\342->!\313\312=\271\217\357\275-{\325\274?\201)\275\211\253\270\275)\347\361\275\354\305\036>v\272\037>\030\256\026\275\027C.\273\356\313\253>\224V%\273\356\275\343\275\341\206\304\275\271:\264<5~]=M\007_\274\317#w\276\374\n\t=P\216%=\263]1=\0051\204\275\316r\210;c\364\006\276\3769\371\275B<\021>5\335$\276|\\e=GN\300=_\241\321=\365j\365=\223\025?\276*=\035>s\351r=\034\206\351<\210\322\223\273\\\'\220>\314\302\221\276~w\257\275\364\221\341\275\rB\026>WI\236=\037i4>84 \275W9\230\2749Q!\275v\217\214=\201\325`\275\251\206\201>\351\240\373\274\021g\212\275\006Y\277\274n\024\037=\007\000\000=#5\332\275\332\301\"\275U\301Y\276\254\272\323\275R<3\2761\343\341=i\313\037\274\255\241\013>v\260\006\275\346k\230=]T\007\276\010\254\224=\256\304\032\276\274c\302=\301\031\316\274\002\023F\276\353\240\230>M\255W>vv`\275LM\033\275.\n\225=fv\337\274\2128\302\274&\252\225>@\226~>v\346\332\275\251\030\014\276r\317\360<\364A$\276\037\033\226;\345S\t\275R\033\203<\027tH\274#\023\365=\371\213F=\037\273\215=~\336\324\275\343em\276\232\330\013>\277\321N>\324\207\032\274\352\275\320=\327\255;;\002\217J\276\004G%>\017CB=\024\276\335;\022o\206>!\221W=L\024\207\276\273\377M\276\340\235\250=R!\023=\332{\361=2u7\276\341\371\267\275\301 \252=\371Z,\274p\370{=\032a\203=DD\'>g\027k\275,\333\353=3s\304\275\313A\273<\251\036g\275f\215:\275\213\342$\274\177\251\375<\362\177u\2741\312\306=\225\177\210\275\260\256\302<$N}=_K\261=6C\227=\233A\213\274\310\'\301=%\244\017\276\037\372\005\276\311z\210\276\234\322M\274W\332s=\341\343+\275\365o\016\276||\336\275X\337\t>?\3604\274\302\006\211\276X\270\251\276\344\371\212=\372?\340=a6\374=\253RF\276\217K\035>\030cA=\242\306\356\275\232gD>\210\332Z\274\300\305\250\273\365\214\037<\252\313I>\006\304L\276Q\377\376\275\262b\001>\315\366\211<\261\021\227=\217\303c\275 \\\350\272!y\204\275/\343\201\276#\261\312=8\234G<\245\006\335=iS8\275\202\003\314=\374\325T\276\213\343\361=\313=\020\276\000 \022\276\315\307\261\276\251ce=F\361g\276\322\373\356\275A\024#>\250\033\032>\364h\366\275&\367\215>\336\343\347=\302\305\024\276\034\315\241\275X0\021>=\242\017\276\032\250\307=p!\367=S\250\014\275\350#\336\274\274\323\207\275~\020+\275|\'\031>N\231\003\274\213\334\227=\350>\256=\235E\205\275\3113\001\274\226\235\336<\036\202\t\276\2513&>\254z\022>\347`E\276\271\206Q>A\224\266\274,F\376:\210\257X\275\330\246>\275\034z\014=\270\327\274=\260\255\037>\234\274Z\276\342\031\t<\325d\020\276&\311\201\276\366\250\310=\327:\212\276\350\025<>\265\375y\275\355\233\330=0<\252\276\276\036\322\274\224\334\023\276t\313+<\365~\006>t\256\201\276\251a\016=Hc#=\365`w=\021\337\267\276\247\345V\275\273\037\360\274\204eO>\027Jf= \036\376\275)\013\020=\356(\231<5\013\246=\2569\252\274!\r\334\274\353u\'\276\245~?=\375#\324=\326\331\305\274\022\222\314\273o\302\025\276\311\360\352\275\214h\376\274\317\007\356\273ev\357\275N\261\330=S\245\030>\001(~;$1\\\274\216VF\275D.\014\276\241\262!\275[\327\335=|O\231=<\270\333=]O\004\274F\322\234\275\353\313\221\275\260\322\333\274\\!4>B\214=>kO\000\276)\t`\2757d\366= 3\357;b\242\310=f\256n\275\324J/>\275\337!>\250F\342=C5\276=\n\332%\276e\037\321\274\345\217\016\276\372\251\227\275p\350(\275l\377\030\275\360\n|=?k3>\315\306\264=\321\334\002\275\233uo\275\357G\254\274\372|\245<\330(\307\274\353\214\016\276\\\247\252\274z\374\350=\264\314\355=\300f\202>\203\257 =\t\343\032\276k\313\230\276\341\376\021>\366\247K\275\373\210\023\275\002\3570>>\334\016>\356d\343\2732V)>,\016c>/\301\306>\373\264\375=\033GK>\023\217\366\275M\315\323\275N\254\337\275 \211\030<\377-3<\014\331\203\275O\215\026=\223#\340=\332?T\275\026\373\273\275x\216\324=\200\0264<f\270\034>\340\313b9\t\203]=\371\335\312=\2655\r;\375\2376\275\036\377\252\276%\204E=l/\013>\003os\276\220\357b\275\344!t=\010\000\021>\336\236/=\215\275\202\274h\r\253=V\311e\275\357B\262\275T\014\301\275\346\026-=#\360E>\'\241J=\216\344\007=NU\324\275\031\264\301\275\032\250\242<\326\215N=\010\257\373=\352\001\260<\21148=\256\226\202=\351kM\275D\206h\275\242\206\247\275\220%\004\274\354\371e>H\266@<ORe=ET\221\276&\363\014\276\0069\337=\322\352\017\276\302dv>\212\017\033>\232\347\217\275l\315\257\274\3701I>\224\025B\276\344w^\276\254\210s=\242\210_\276V\332\234<\360j\240<%\377o\275\'\350\n= !\270\275\324I\257<\230\0130>\r\336C\276\023\343W>\264R\214\275D\203\256=\345\3536\276\346\267\200>d2^>\306\370s\275zA\006\276\311\267\'\276\244\236\262<\331\306\r>\210\206|=2\\\017>\226\343\315<>\224\003>zo\005\276\023<&\2767\305t=\241B\244=\020\347m\276l\027\365=\313\3628>\261\247\\<L\274\343=\2006\262\274\257\036\221>\t\311(\276\200\324\232\275\236i\272=if\241\276\355\307\265=\201;\350\274O|m\276\341b\266=\'\337\023\276OM\005>\230\2255>\204\316\323=\271\2700\276|\363#=\204\300\032\276\351\005\241=\t\230a\274\302\244\230\273\274\276Q>\256\356\306=,\037\234=Q\220\264\275\230\001Q\275\177Z\005>\377\r\237=\261\3575>w\037a\275\027\177\033>7\272/\275\365;\376\275\316o\032>\273H_<H\302l\2750\372\320=\352\262e=\327\230\274=\266\376\205=\315\315\014>\222\221Q>\311\240\335\275\246\214\256\275%\371&>!\255\002\276\026V<\276\221I\021\276A\301\360\274<\340@==\326\301\275\t\262L=\272Z\313\275\244\031.>Vs\255\275\177\031\303\276\033$>\275?\312H>\276\343\r>\317\363(\275\213F\226=\302F\376\273\2624\266\275\246\220\326=\232\346!>\261\260\242=\307Y\245\276p+w\275\227J5<\336u\352=\251\3458>\215Y\310=\214\022\340\275\210\317\335=\325\037\315<\372\007\216=O/#=\234\360\016>\311\331\"\276h\245\373;eGY\275\261\212\'\276G\2315\275X2\264=\352\222\351\275\217\226[=\334\022\222\274\032`\340\274e1\317\275m\356\202=\203jC>\"\244\342;\333q=\272\370\002\313=s\250\301\274\332\307\211>U(F>@K\332; R\257=0\224\237\275\227\216!<`-V\276\372_\201=\032\200\203\276\023g\365=Xm\376\275>}\037\276\313S\267=[\323\305=.8z\2762\\?\275i.\232\274\021+\316=\320c!>#\331\235\275|\\\021>\005\345\323\275\031\032\321\275\200v\256\275\031\362p\276{1g\275\212\324\037\276Q\301e\275U;\267\275}\366\224\275\366\241\027\274ZW7\275\214\\D\275?\n\002>\005\353\252\275\310\204\254=\370\010\357\275\211\313(>\034\275:<\026H\316\275\334\213{>\000\266(\274\260\250\261\275L6k>\255t!>\221\227w\276o\326\200>\024\256R\276\371\017\235\275\271g\202::\335\300=\313\250\357==m\343;u\362\200\276\350\237b>\214\\ \274\267%\256=f\312\263\275\362\263W>+\310o\276\244\361\235=\000f\017=W\000\245=%P\001\276\334\2000\275\227\366W\275\27682\275\003\275s;S^\023\275\321\322\241<!1\r\276\3703\302=P\013\252=b]\274\275\nL\263=\016\025\001>\336|\021\276\213Ta\276\177\263\217\2756\027\271<Z*\261\275\363v\205\275\016\261\\<m\t.=\245\316\360\275\372S\027\276\005\327\262=F\\\341=\2711\200=\361\r\242=\260=&\276\324\340\210>J\245\207\273s\235\035\276\341\025\022=\220\370r=g\274\344<\372\242S>|P\202\275H\231R>\251\335\232\275+\342\213<\001\005m\276\0164\254=\264$\246=\272q\000\275\3334\201\275?\032%\276\364\351-=\031\205X>f(E=\220w\204>\016\336\370\275\337I\323\275j\371M\275I\361$>\217P\312<\327R\371\275-\304\013>\327\t\216>\000\337G=\225*\357\275\177\n^\274o\343\020>\243\211\210\275\026K\362\273\257\271\204\276I\312P>\300\222b\275~h\343\275+\2229\276\334O6<\256\210\307\274\267\313\203\272\272\177q\275?\3728=\340\001\316<\234\311\311=\\\204H=q\331;>\341\315\033\274+\220\246\275kb\205=[\240\331=\243\206l\275C\333&\276\001\177\346=^0\323\275\325\234/\2760\2751=E\237#\276\'\355\340\275\177k\"=\034\373\367=r\263P=\2448\357=-\304\244>\202\227\271=3&l>\227u[=q\277\325:\302\2279>[>\370=\373b\314=@3\257=@\235\256\275^\277\n\273\244\327X>A.\221\2766\0328=D>\235\276\330t\237=~\324\312=\277\230\257\274CG\032>b\033\225\276\226\363\311\275a\021\370=\215\251v<oB\230=\224\256\007\276w0E\274\335,\313=\206x\252>\341\306\276\274=\324d\275\330\027\035\275\0374~=\334\272\200<\311q\252\275\\\257\274\274\264q\314\273\247\327\223>\007;\214=\314a\375=F\331\222<\026o!=4\256\232=\374\262c\275\224\315\024>\204\310\357<l\244v>\037~W>y\367m=\226Q\214\273$)\363\274h\245\353\275/\313M\2765\002%=VS?\275-_0\276\200#\265<\223\366\343\275\033\205\216\276\303k\334<%y\005>\376w6\276\226$\312=W\212\340\275$\301\306\275\261\207\032=GK\340=\342\333\323=\335\352\361\275\235\201\266\275\260\"\201>\347\205+=\323\001\023\275T\271\377=\317\255\303\275\337)\027\276\\\373\325\275\255\014z\275\313\344\274<}\355n>\327\tA\275\214;\022>1J\366\275d\307\270=n\016:\275\312\217\207=\3749h\273g\335E<\022\'*>\347\375\363:\245|\211\276KV\253=\366\177\\<\030\231L>\251\313\350=\345\202x\276\037\264\256\275{$\211\275\201\303T>~\217\256=\237\326\023\275S\023`\275\207\354\247\275\017\271\014\275\273v\221\276\\\210G\276Q\202\304\274Z\216i\274z\361S\276\354\306W\273\344 E=\232\267\023>\343\216\003>\"\207\256\276\303\027{\275\343\217\251\275\027Q|\274!\010\234\274\t\361\343\274:=\222=-O\204\276\036k\306\275\272\321\251\275$\026\224\275\031\2543>z\355\251=s\226\002>\013C\033\276P\323\343\274\222\203\234=[\014|=;F<\273\212B/<]\236m\274\230\312[\276\r\006\336\272}Af\276\234F\322=\331\227\272<Po\t>>\333L\276\241\025m<N\000l\2748\022\232<|\213\342=!\371\231\275\262\201\023\276\237\302\343\275nz\006<tIA\276\333\267\014\276\335L2=\334m\271\275\327>V\2763+\016\276\330\263\206\276\361\026\007\275\222\365\010\276\2704\330<\325\334V\276\234\2541\276_\030\014\276\320\235\256=E6\232\275\262dC>y_\340=6\202H<\3454\032>\301It=\216\375\335\273\3164\310=\360!s>Pi\322\273\216\254\227=\275\013\235=\216m\036>\247\370\361=\367\273e\275c\353\265<\326[\263\276Q\227\334=\254\237\005>g\345\005\276\337n7\272\222*}>\"\271\267=\355\344\332=\330G\"\276=\301\223<{u\222\274+\353\365=\271\326\024=:\335\177\275\022\'\240=\247>]\276\366I\205=X\246%\273~\313\000\275W\306\346\274\r\235;\275i\275.>Y%\303\275\030\205\253=\356\013\333=\013\363\255\275\345\027\220=\220\220\252<>\370\354<\224a\313=\001i\227\276s\325f\276\225\242\243=\377\342\231\275\337\2458>l<o\276\240}\270=\024\263\256\275\303\023Y=\231uE\276F\3773\276\275\270[\274j\256\205<\217]\361=\343i\005\276k\212\003\276\301!\327=\0039\205;\0030\323\274\207\025\234=cvS;\251\320\264\274ay\255\275\202qy=\263\371\247\276R\326C=\035\314\036>\246\223\261=!s\320\275\305!\t\276I#P=\201\004\372\275u\\O>\223\301u\275v@\037\276\004\211\216\275\334$S\276\014[(\276d\036)<\353\275\336\274&>=\276J\310\002<F\003\314;2z\317\275R\305\010\275P\353S=\032Q\344=\262O\210=1\371\020>\300d*\274\207\"\237\273\304\320w=st\213\276\256\371\212=\'\334o\275\033\264<\276%C\312\275I\\\003>\347\342\370\275K\032H>\000d\315\275\337\314K\276\332\002\316\274!\267\212>\352\242\242\2755\276\212>\3744%\276\001<K\276\372\304\310\275\267Q\225\275C\337t=/\022>= \321\236=Q\010\224=\362\375\343\275\210\354\334\275\271S\206>+\'e\274\364y/\276\207\3232>?\360\224\276\3053@\275\256\215\002\275\234\\\002>\177>\374\275\243K\270=ZM\010\275\346\241v<\362j\331\275\203 \036>\230s\037>M`*;\223\220\024\276VfH=\3579\367\274\324~$\275i\2272>P\347w\2751\227`\275\347\301\242=\317\030\206\276K\333\026>\334\361\333\275\374\252\267>\231\227]\275\266\252L\276\234\006\000;c\311\212\275i\237<\275\211\332\'\274%\254\323=\273\250[>\234T\265=\351\315\261\275\300\002\354\275\305zI>k\357\007>5Q\264;\200\235\304=\nB\267=\247S\350\275_\370\266=\375\2613\276\033\262|;\1770\017>zN\342\274\246\267\256=\3746\272;\355\033\234\274\360Q}=\366K\230=\035n\333=\263\267\340=\375\273\335\274\375t\256=\300\334\035>v\010\305\273n\222n=\333\314\036=\036yk\276\016i =8\343\007\276\354\234\345\275\213\205\271=\007\316W\274\361o\347=X\006:>n\364\014\276(^\242\272P\266\205>\316\244G>W\255I\275x\003;=Gi\312=v\255P=\2367\033>)W\313=\302\323\277>8y\013\275\314o\363\275\253\222\312\276?\215\203\275\370\354L>\353\350\314\275\270z\037>v\210\331<\332\203&>\\\336[<\265/\031=o\356]\274\274\322\360\275\004\231\307\275.\253\016\276\233?W\276\364K\"\274#>\223<\361K\305\274\002\350\276<\244\244\222\275B(9\275\365\274\271=\276\177\323\275\227H\033\275V\034I>\332\2668>\254\233\311\275\033+-<\004d\026>E\240\270\275\331U\030\276\001\300\033\276\035{\034>3\006\334\274\217\230\246\275\230\251\370\274\347\332\275;\036\020};\313\223F=\257\200\250\275\2358\360\274o\371\251>\336\316\275=\320\202o=\334\357U\275\206\0371=d\312V=$j\017>\217\366g=\252\026\211>\315o\024>N\242\320=\210\\+=c_H\276\254.\030\275>\202W\276\260+a\275\327\341\234\275\023\021\217>\324\020\027\275\335\325\367=}7\204=\212\033G>?\205\317=x\215\315=\274\211a\275\036\026\003=\357\374q=\026\034)\275\203D\245;ufD\276\374f7>xl\316\275niM\275\026O3=\247JX>\356\313\264=T\003\332=\206\2230=\373\207\314=\337\245\252=^\374\177\276\333\024/>V\352\'\275@\177K\274\216i\326;\2626\250>\305\027=<\005y.\276\177\260\026=\177Kz\274\331:8\276\031\007D\275\200P\246=z\310\t\276\233\002\363\275\033\373\357=o\206\324\275\\l!>\216A\315\275\227&\356=\226\206\026\275\244y\210>\255\324a\274H:\'\276\342j\360=\305\317\002>*A\233\276\274\266e>\236k\275=sC\326=f\360\373\274\333\272K<\031O\351=\253\005\244=_\037\261<q)\007\275f\366}=\313`\236=\271\334R=\370\355,><\341\241\276H[\020\276\315:o=\266\tr=\370\316M<;\010;=B9\244<\341\000\020\274t\246\334=e\243Z>\243\255m<z\0204=oHY\276\252\361U=\256\326Z<\311\361\211=\232\214\242=\034\213h\275G\202\374\275\336\005P\276\363\272\325\273\332\305\320=p]\002>^\t\035\276Xi\016\276\217\363%9\330^\233\276"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_1"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_11/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_11"
  op: "StridedSlice"
  input: "net/Shape_1"
  input: "net/strided_slice_11/stack"
  input: "net/strided_slice_11/stack_1"
  input: "net/strided_slice_11/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_2"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_12/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12"
  op: "StridedSlice"
  input: "net/Shape_2"
  input: "net/strided_slice_12/stack"
  input: "net/strided_slice_12/stack_1"
  input: "net/strided_slice_12/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones/mul"
  op: "Mul"
  input: "net/strided_slice_12"
  input: "net/strided_slice_11"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones/Less/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1000
      }
    }
  }
}
node {
  name: "net/ones/Less"
  op: "Less"
  input: "net/ones/mul"
  input: "net/ones/Less/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones/packed"
  op: "Pack"
  input: "net/strided_slice_12"
  input: "net/strided_slice_11"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "net/ones/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones"
  op: "Fill"
  input: "net/ones/packed"
  input: "net/ones/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20000000298023224
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
